debug/adyen/examples/payment_refund.xml

<?xml version="1.0"?> <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"> <soap:Body> <ns1:refund xmlns:ns1="http://payment.services.adyen.com"> <ns1:modificationRequest> <merchantAccount xmlns="http://payment.services.adyen.com"> YOUR_MERCHANT_ACCOUNT </merchantAccount> <modificationAmount xmlns="http://payment.services.adyen.com"> <currency xmlns="http://common.services.adyen.com">EUR</currency> <value xmlns="http://common.services.adyen.com">1000</value> </modificationAmount> <originalReference xmlns="http://payment.services.adyen.com"> PSP_REFERENCE </originalReference> </ns1:modificationRequest> </ns1:refund> </soap:Body> </soap:Envelope>
